main.floors.END=
{
    "floorId": "END",
    "title": "",
    "name": "",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": false,
    "cannotViewMap": true,
    "cannotMoveDirectly": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "X10005",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": [
            "\t[小妖精,fairy]唔......睡得好饱啊。",
            "\t[小妖精,fairy]咱好像做了一个很长很长，长到仿佛永远也醒不来的梦......",
            "\t[小妖精,fairy]你是谁？",
            "\t[小妖精,fairy]咱认识你吗？",
            "\t[小妖精,fairy]好奇怪......为什么咱一看到你，泪水就会止不住地流？",
            {
                "type": "sleep",
                "time": 1314,
                "noSkip": true
            },
            "勇者笑了笑，伸手拭去了她脸上的泪水。",
            "\t[勇者,hero]初次见面，妖精小姐，我是勇者。",
            {
                "type": "win",
                "reason": "happy ending",
                "norank": 1
            }
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20,  0,  0,  0,  0,  0,  0,  0,151,151,151,151],
    [ 20, 20, 20, 20,  0,  0,  0,  0,  0, 20, 20,151,151],
    [ 20, 20, 20, 20, 20,  0,124,  0,  0, 20, 20,151,151],
    [  0, 20, 20, 20, 20,  0,  0,  0,  0, 20, 20, 20,151],
    [  0, 20, 20, 20, 20,  0,  0,  0,  0, 20, 20, 20,151],
    [151, 20, 20,  0, 20,  0,  0,  0,  0,  0,10290, 20,151],
    [151, 20, 20,  0,  0,  0,  0,  0, 20, 20, 20,151,151],
    [151, 20, 20,  0,  0,  0,  0,  0, 20, 20, 20,151, 20],
    [151,151,151,  0,  0,  0,  0, 20, 20, 20,151,151, 20],
    [151,151,151,  0,  0,  0,  0, 20, 20, 20,151,151, 20],
    [151,151,151, 20,  0,  0,  0,  0, 20, 20, 20, 20, 20],
    [  0, 20, 20, 20, 20, 20,  0,  0, 20, 20, 20,10303,10303],
    [ 20, 20, 20, 20, 20, 20, 20,  0,  0,  0,10303,10303,10303]
],
    "bgmap": [

],
    "fgmap": [

]
}