main.floors.MT0=
{
    "floorId": "MT0",
    "title": "主塔 0 层",
    "name": "0",
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "defaultGround": "grass",
    "images": [],
    "ratio": 1,
    "map": [
    [  4,  4,  4,  4,  1,  1, 87,  1,  1,  4,  4,  4,  4],
    [  4,  4,  4,  4,  1,  1,  0,  1,  1,  4,  4,  4,  4],
    [  4,  4,  4,  4,  1,  0,  0,  0,  1,  4,  4,  4,  4],
    [  1,  1,  1,  1,  1,124,  0,  0,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  0,  0,  0,  0,  0,  1,  1,  1,  1],
    [  2,  5,  5,  2,  0,  0,  0,  0,  0,  2,  5,  5,  2],
    [  2,  5,  5,  2,  0,  0,  0,  0,  0,  2,  5,  5,  2],
    [  2,  5,  5,  2,  2,  2,  0,  2,  2,  2,  5,  5,  2],
    [  2,  5,  5,  5,  5,  2,  0,  2,  5,  5,  5,  5,  2],
    [  2,  5,  5,  5,  5,  2, 85,  2,  5,  5,  5,  5,  2],
    [  2,  5,  5,  5,  5,  2, 85,  2,  5,  5,  5,  5,  2],
    [  2,  5,  5,  5,  5,  2, 85,  2,  5,  5,  5,  5,  2],
    [  2,  2,  2,  2,  2,  2, 88,  2,  2,  2,  2,  2,  2]
],
    "firstArrive": [
        "\t[小妖精,fairy]喂！醒醒！",
        "\t[小妖精,fairy]喂你这家伙！口水都滴到咱的翅膀上了啊！",
        "\t[勇者,hero]诶......嘿嘿嘿嘿......公主大人......滋溜......",
        "\t[小妖精,fairy]所以说你这种家伙到底是怎么当上勇者的啊？！",
        {
            "type": "jumpHero",
            "time": 500
        },
        {
            "type": "changePos",
            "direction": ":right"
        },
        "\t[勇者,hero]吓！你你你是什么鬼东西！",
        "\t[小妖精,fairy]所以说咱是......等等，你刚刚好像摆出了一副准备揍咱一顿的架势啊。",
        "\t[勇者,hero]这是勇者遇到魔物的正常反应啊。",
        "\t[小妖精,fairy]哈啊？停一下，勇者手册上应该有说明我的种族吧？",
        "\t[勇者,hero]啊？勇什么手册？",
        "\t[小妖精,fairy]就是那本，通过勇者选拔笔试必备的小册子啊。",
        "\t[勇者,hero]啊？什么者手册？",
        "\t[小妖精,fairy]会期待你是用正当手法通过勇者选拔的我真是个笨蛋！",
        "\t[小妖精,fairy]还是咱自己说明吧，咱正是古老的妖精族派支，妖精族历来自愿担任着魔塔引路人一职，以魔塔的守护精灵自居，简而言之就是免费的导游啦。",
        "\t[勇者,hero]这样啊，原来是自己人，你好你好。",
        "\t[小妖精,fairy]别晃的那么用力，咱可是很娇弱的啊！",
        "\t[勇者,hero]......噢对了，我想起来了！我刚刚应该是在跟强大魔物的战斗中落败了吧？",
        {
            "type": "jumpHero",
            "time": 500
        },
        {
            "type": "changePos",
            "direction": ":right"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "changePos",
            "direction": ":right"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "changePos",
            "direction": ":right"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "changePos",
            "direction": ":right"
        },
        "\t[勇者,hero]那随我而来的我的同伴们......诶？活下来的只有我一个人吗？那家伙果然强的可怕啊，这么说来应该是妖精小姐把伤痕累累的我从死线中救出来的吧，多谢搭救！",
        "\t[小妖精,fairy]......",
        "\t[小妖精,fairy]......不，你那些同伴早就提着剑气势汹汹的杀上去了，你只是被几个最低级的史莱姆给吓晕了而已，除了脑子本来就有点问题，身体大体上并无大碍。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[勇者,hero]啧。",
        "\t[小妖精,fairy]你这副谎言被识破以后闹起小脾气来的表情是怎么回事！赶快跟其他被称作勇者大人的人道歉啦！",
        "\t[勇者,hero]好嘞！事不宜迟，这就向魔塔进发！打败魔王，迎娶公主！",
        "\t[小妖精,fairy]这家伙居然重新振作起来了？",
        "\t[勇者,hero]初次见面，妖精小姐，我是勇者。",
        "\t[小妖精,fairy]......不对，好像只是在逃避现实而已。",
        "\t[小妖精,fairy]咳咳，你这家......勇者大人，初次见面，我是这座魔塔的第二十九届守护精灵，你在魔塔冒险的期间里，我将会提供忠告跟规则范围内允许的一定帮助。",
        "\t[小妖精,fairy]你那破剑破盾被年幼的魔物们拿去铲泥巴了，咱记得剑在一层，盾在六层，这消息或许对你有用来着。",
        "\t[勇者,hero]谢谢你妖精小姐！这些信息对我很有帮助！",
        "\t[小妖精,fairy]......非常标准的公式化回答呢，竟然让我一瞬间产生了他是正统勇者的错觉。",
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    3
                ]
            ],
            "remove": true
        }
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,12": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,0": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "bgmap": [

],
    "fgmap": [

],
    "width": 13,
    "height": 13,
    "autoEvent": {},
    "beforeBattle": {},
    "cannotMoveIn": {}
}