main.floors.MT0=
{
    "floorId": "MT0",
    "title": "主塔 0 层",
    "name": "主塔 0 层",
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "defaultGround": "grass",
    "images": [],
    "ratio": 1,
    "map": [
    [  4,  4,  4,  4,  1,  1, 87,  1,  1,  4,  4,  4,  4],
    [  4,  4,  4,  4,  1,  1,  0,  1,  1,  4,  4,  4,  4],
    [  4,  4,  4,  4,  1,  0,  0,  0,  1,  4,  4,  4,  4],
    [  1,  1,  1,  1,  1,124,  0,  0,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  0,  0,  0,  0,  0,  1,  1,  1,  1],
    [  2,  5,  5,  2,  0,  0,  0,  0,  0,  2,  5,  5,  2],
    [  2,  5,  5,  2,  0,  0,  0,  0,  0,  2,  5,  5,  2],
    [  2,  5,  5,  2,  2,  2,  0,  2,  2,  2,  5,  5,  2],
    [  2,  5,  5,  5,  5,  2, 85,  2,  5,  5,  5,  5,  2],
    [  2,  5,  5,  5,  5,  2, 85,  2,  5,  5,  5,  5,  2],
    [  2,  5,  5,  5,  5,  2, 85,  2,  5,  5,  5,  5,  2],
    [  2,  5,  5,  5,  5,  2,124,  2,  5,  5,  5,  5,  2],
    [  2,  2,  2,  2,  2,  2, 88,  2,  2,  2,  2,  2,  2]
],
    "firstArrive": [
        {
            "type": "if",
            "condition": "(flag:hard===1)",
            "true": [
                "简单难度补给：生命+200，黄钥匙*1，攻击+1，防御+1",
                {
                    "type": "setValue",
                    "name": "status:hp",
                    "operator": "+=",
                    "value": "200"
                },
                {
                    "type": "setValue",
                    "name": "status:atk",
                    "operator": "+=",
                    "value": "1"
                },
                {
                    "type": "setValue",
                    "name": "status:def",
                    "operator": "+=",
                    "value": "1"
                },
                {
                    "type": "setValue",
                    "name": "item:yellowKey",
                    "operator": "+=",
                    "value": "1"
                }
            ]
        },
        {
            "type": "sleep",
            "time": 500,
            "noSkip": true
        },
        "\t[小妖精,fairy]喂！醒醒！",
        "\t[小妖精,fairy]喂你这家伙！口水都滴到咱的翅膀上了啊！",
        "\t[勇者,hero]诶......嘿嘿嘿嘿......公主大人......滋溜......",
        "\t[小妖精,fairy]所以说你这种家伙到底是怎么当上勇者的啊？！",
        {
            "type": "jumpHero",
            "time": 500
        },
        {
            "type": "changePos",
            "direction": ":right"
        },
        "\t[勇者,hero]吓！你你你是什么鬼东西！",
        "\t[小妖精,fairy]所以说咱是......等等，你刚刚好像摆出了一副准备揍咱一顿的架势啊。",
        "\t[勇者,hero]这是勇者遇到魔物的正常反应啊。",
        "\t[小妖精,fairy]哈啊？停一下，勇者手册上应该有说明我的种族吧？",
        "\t[勇者,hero]啊？勇什么手册？",
        "\t[小妖精,fairy]就是那本，通过勇者选拔笔试必备的小册子啊。",
        "\t[勇者,hero]啊？什么者手册？",
        "\t[小妖精,fairy]会期待你是用正当手法通过勇者选拔的我真是个笨蛋！",
        "\t[小妖精,fairy]还是咱自己说明吧，咱正是古老的妖精族派支，妖精族历来自愿担任着魔塔引路人一职，以魔塔的守护精灵自居，简而言之就是免费的导游啦。",
        "\t[勇者,hero]这样啊，原来是自己人，你好你好。",
        "\t[小妖精,fairy]别晃的那么用力，咱可是很娇弱的啊！",
        "\t[勇者,hero]......噢对了，我想起来了！我刚刚应该是在跟强大魔物的战斗中落败了吧？",
        {
            "type": "jumpHero",
            "time": 500
        },
        {
            "type": "changePos",
            "direction": ":right"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "changePos",
            "direction": ":right"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "changePos",
            "direction": ":right"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "changePos",
            "direction": ":right"
        },
        "\t[勇者,hero]那随我而来的我的同伴们......诶？活下来的只有我一个人吗？那家伙果然强的可怕啊，这么说来应该是妖精小姐把伤痕累累的我从死线中救出来的吧，多谢搭救！",
        "\t[小妖精,fairy]......",
        "\t[小妖精,fairy]......不，你那些同伴早就提着剑气势汹汹的杀上去了，你只是被几个最低级的史莱姆给吓晕了而已，除了脑子本来就有点问题，身体大体上并无大碍。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[勇者,hero]啧。",
        "\t[小妖精,fairy]你这副谎言被识破以后闹起小脾气来的表情是怎么回事！赶快跟其他被称作勇者大人的人道歉啦！",
        "\t[勇者,hero]好嘞！事不宜迟，这就向魔塔进发！打败魔王，迎娶公主！",
        "\t[小妖精,fairy]这家伙居然重新振作起来了？",
        "\t[勇者,hero]初次见面，妖精小姐，我是勇者。",
        "\t[小妖精,fairy]......不对，好像只是在逃避现实而已。",
        "\t[小妖精,fairy]咳咳，你这家......勇者大人，初次见面，我是这座魔塔的第二十九届守护精灵，你在魔塔冒险的期间里，我将会提供忠告跟规则范围内允许的一定帮助。",
        "\t[小妖精,fairy]你那破剑破盾被年幼的魔物们拿去铲泥巴了，咱记得剑在一层，盾在六层，这消息或许对你有用来着。",
        "\t[勇者,hero]谢谢你妖精小姐！这些信息对我很有帮助！",
        "\t[小妖精,fairy]......非常标准的公式化回答呢，竟然让我一瞬间产生了他是正统勇者的错觉。",
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    3
                ]
            ],
            "remove": true,
            "time": 500
        }
    ],
    "parallelDo": "",
    "events": {
        "6,11": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[小妖精,fairy]地下层的通道咱已经帮你开启了。",
                "\t[小妖精,fairy]不过地下层的凶险程度可不是地上层的区域可以比拟的。",
                "\t[小妖精,fairy]无论是怪物的强度还是地形的复杂程度，都对初心者很不友好，万事谨慎。",
                "\t[勇者,hero]嗯，知道了，我会小心的。",
                "\t[小妖精,fairy]好了，那咱的工作就到这里了。",
                "\t[勇者,hero]妖精小姐不跟我一起下去吗？",
                "\t[小妖精,fairy]啧，那种又脏又暗又潮湿的地方咱才不想去呢。",
                "\t[勇者,hero]唉，没有妖精小姐在的话我会很不安心啊。",
                "\t[小妖精,fairy]笨蛋......瞎说什么胡话呢。",
                "\t[小妖精,fairy]放心吧，其实咱不跟着你过去是因为，地下层的怪物能无视妖精族释放的香气，如果咱贸然进入的话很可能会遭遇不测。",
                "\t[勇者,hero]这样啊......",
                "\t[小妖精,fairy]你也不必担心，妖精族可是很尽职的，咱已经联系好了在地下层工作的暗妖精族朋友，接下来的旅途就由她指引你了。",
                "\t[勇者,hero]暗妖精族？听起来不像是什么好惹的角色啊......",
                "\t[小妖精,fairy]暗妖精族是妖精族很稀少的一个分支，隶属混乱中立势力，能够操控魔物，即便在整个魔物圈里都是很强的存在。",
                "\t[勇者,hero]我突然不想去地下层了......",
                "\t[小妖精,fairy]你也不必担心啦......怎么说呢，咱这个暗妖精族的朋友，有一点点特别。",
                "\t[小妖精,fairy]总之肯定不会对你不利的，反倒是如果你胆敢欺负她，咱可是会毫不留情地把你轰杀成渣哦！",
                "\t[勇者,hero]......一直在被欺负的人好像是我这边才对吧。",
                "\t[小妖精,fairy]咳咳......就这样吧，祝你好运。",
                "\t[小妖精,fairy]地下层很危险的，务必多加小心啊。",
                "\t[勇者,hero]知道啦，啰嗦的丫头。",
                {
                    "type": "hide",
                    "remove": true,
                    "time": 500
                }
            ]
        }
    },
    "changeFloor": {
        "6,12": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,0": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "bgmap": [

],
    "fgmap": [

],
    "width": 13,
    "height": 13,
    "autoEvent": {},
    "beforeBattle": {},
    "cannotMoveIn": {}
}