main.floors.MT1=
{
    "floorId": "MT1",
    "title": "主塔 1 层",
    "name": "1",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        "\t[勇者,hero]扎堆的怪物与无穷无尽的机关，这里就是魔塔的内部吗。",
        "\t[勇者,hero]呼，那么接下来就得硬着头皮上了。",
        {
            "type": "moveHero",
            "steps": [
                "up:2"
            ]
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    11
                ]
            ]
        },
        {
            "type": "trigger",
            "loc": [
                6,
                11
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,11": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[勇者,hero]哇啊啊！！妖妖妖精小姐！你怎么跟过来了！",
                "\t[小妖精,fairy]我不跟过来的话，不管怎么想你都会死在哪个臭烘烘的角落里吧......",
                "\t[勇者,hero]可这座塔机关重重，到处都是穷凶极恶的魔物，妖精小姐你又没有什么战斗能力......",
                "\t[小妖精,fairy]妖精一族能散发出让周围魔物暂时温顺化的体香，就算遭遇危机，咱也能用空间法术跟你刚才看到的匿影术规避。",
                "\t[小妖精,fairy]比起考虑咱的安危，你现在更应该好好审视一下自己的处境才是。",
                "\t[勇者,hero]好吧......",
                "\t[小妖精,fairy]咱接下来要讲的知识你必须一字不漏的记住，这直接关乎到你在这座塔里能苟活多久。",
                "\t[勇者,hero]......这第一句话就不吉利到家了。",
                "\t[小妖精,fairy]魔塔内部四周的元件叫做墙体，是构成迷宫的主要元件，根据区域的不同，材质跟颜色都会产生很大的差异。",
                "\t[小妖精,fairy]能用钥匙打开的门分为黄、蓝、红、绿四种，一把钥匙在开过门之后就会立即消失，所以钥匙是非常宝贵的物品，宝贵程度依次是黄、蓝、红、绿。",
                "\t[小妖精,fairy]当然塔里还有其他种类的门，开启方式更加复杂，可能要杀死特定的魔物，或者触发对应的事件。",
                "\t[小妖精,fairy]左下角这个是铁门，由于这座塔年代久远，铁门已经生锈了，因此不需要任何钥匙。",
                "\t[小妖精,fairy]构成塔内地形的元件差不多就是这些，喂......你有好好在听吗？",
                "\t[勇者,hero]Zzzz......啊，当然，刚才说到哪来着？",
                "\t[小妖精,fairy]算了......明明知道你这种吊儿郎当的勇者在这座塔里活不过三分钟，替你操心的咱果然是个笨蛋！！",
                {
                    "type": "sleep",
                    "time": 700
                },
                "\t[勇者,hero]......",
                "\t[勇者,hero]她好像很生气啊。",
                {
                    "type": "hide",
                    "remove": true
                }
            ]
        },
        "11,10": [
            "\t[普通老人,man]我是普通老人，每座魔塔里都少不了我的身影。",
            "\t[普通老人,man]我会出现在任何令你感到匪夷所思的地方。",
            "\t[普通老人,man]我无处不在，如影随形。",
            "\t[普通老人,man]我对这座塔的秘密了如指掌。",
            "\t[普通老人,man]只要你找到我，我就会像npc一样为你提供有用的信息。",
            "\t[勇者,hero]好可疑的人......简直比魔物还要可怕。",
            "\t[普通老人,man]我们一定会再次见面的，如影随形，来去无踪......",
            {
                "type": "hide",
                "remove": true
            },
            "\t[勇者,hero]凭空消失了......",
            "\t[勇者,hero]这人无论如何都跟普通沾不上边吧......"
        ]
    },
    "changeFloor": {
        "7,6": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,12": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1, 22, 23, 21,  1,203,202,201,  1, 32,  0,123,  1],
    [  1, 27, 27, 28,  1, 35,  1, 86,  1, 32,  0,  0,  1],
    [  1, 32, 32, 32,  1,  1,122,  0,  1,  1, 84,  1,  1],
    [  1,  1, 83,  1,  1,  0,  0,  0,209,210,  0, 32,  1],
    [  1, 27, 21,201,202,205,  1,  1,  1,  1, 82,  1,  1],
    [  1,  1, 81,  1,  1, 86,  1, 87,  0,202,  0, 28,  1],
    [  1, 31,201,  0,  1, 27,  1, 46,  0,  1,201,  0,  1],
    [  1,210,  1,  0,202, 21,  1,  0,201, 81,  0, 32,  1],
    [  1,  0, 81,  0,  1, 81,  1, 82,  1,  1, 81,  1,  1],
    [  1, 28,  1,201,  1,  0,  0,  0,201, 21, 22,121,  1],
    [  1, 22, 86,  0, 81,  0,124,  0,  1, 45,1265, 27,  1],
    [  1,  1,  1,  1,  1,  1, 88,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

]
}