main.floors.MT1=
{
    "floorId": "MT1",
    "title": "主塔 1 层",
    "name": "1",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        "\t[勇者,hero]扎堆的怪物与无穷无尽的机关，这里就是魔塔的内部吗。",
        "\t[勇者,hero]呼，那么接下来就得硬着头皮上了。",
        {
            "type": "moveHero",
            "steps": [
                "up:2"
            ]
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    11
                ]
            ]
        },
        {
            "type": "trigger",
            "loc": [
                6,
                11
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,11": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[勇者,hero]哇啊啊！！妖妖妖精小姐！你怎么跟过来了！",
                "\t[小妖精,fairy]我不跟过来的话，不管怎么想你都会死在哪个臭烘烘的角落里吧......",
                "\t[勇者,hero]可这座塔机关重重，到处都是穷凶极恶的魔物，妖精小姐你又没有什么战斗能力......",
                "\t[小妖精,fairy]妖精一族能散发出让周围魔物暂时温顺化的体香，就算遭遇危机，咱也能用空间法术跟你刚才看到的匿影术规避。",
                "\t[小妖精,fairy]比起考虑咱的安危，你现在更应该好好审视一下自己的处境才是。",
                "\t[勇者,hero]好吧......",
                "\t[小妖精,fairy]咱接下来要讲的知识你必须一字不漏的记住，这直接关乎到你在这座塔里能苟活多久。",
                "\t[勇者,hero]......这第一句话就不吉利到家了。",
                "\t[小妖精,fairy]魔塔内部四周的元件叫做墙体，是构成迷宫的主要元件，根据区域的不同，材质跟颜色都会产生很大的差异。",
                "\t[小妖精,fairy]能用钥匙打开的门分为黄、蓝、红、绿四种，一把钥匙在开过门之后就会立即消失，所以钥匙是非常宝贵的物品，宝贵程度依次是黄、蓝、红、绿。",
                "\t[小妖精,fairy]当然塔里还有其他种类的门，开启方式更加复杂，可能要杀死特定的魔物，或者触发对应的事件。",
                "\t[小妖精,fairy]左下角这个是铁门，由于这座塔年代久远，铁门已经生锈了，因此不需要任何钥匙。",
                "\t[小妖精,fairy]构成塔内地形的元件差不多就是这些，喂......你有好好在听吗？",
                "\t[勇者,hero]Zzzz......啊，当然，刚才说到哪来着？",
                "\t[小妖精,fairy]算了......明明知道你这种吊儿郎当的勇者在这座塔里活不过三分钟，替你操心的咱果然是个笨蛋！！",
                {
                    "type": "sleep",
                    "time": 700
                },
                "\t[勇者,hero]......",
                "\t[勇者,hero]她好像很生气啊。",
                {
                    "type": "hide",
                    "remove": true
                }
            ]
        },
        "11,10": [
            "\t[普通老人,man]我是普通老人，每座魔塔里都少不了我的身影。",
            "\t[普通老人,man]我会出现在任何令你感到匪夷所思的地方。",
            "\t[普通老人,man]我无处不在，如影随形。",
            "\t[普通老人,man]我对这座塔的秘密了如指掌。",
            "\t[普通老人,man]只要你找到我，我就会像npc一样为你提供有用的信息。",
            "\t[勇者,hero]好可疑的人......简直比魔物还要可怕。",
            "\t[普通老人,man]我们一定会再次见面的，如影随形，来去无踪......",
            {
                "type": "hide",
                "remove": true
            },
            "\t[勇者,hero]凭空消失了......",
            "\t[勇者,hero]这人无论如何都跟普通沾不上边吧......"
        ],
        "6,3": [
            {
                "type": "if",
                "condition": "(flag:talkedWith3FShop===0)",
                "true": [
                    "\t[商人,trader]桀桀桀桀......能平安抵达这种地方的勇者，你可是第一个呢。",
                    "\t[勇者,hero]若无其事地做出了魔王风格的发言，这位老伯不简单啊。",
                    "\t[商人,trader]桀桀桀桀！那是当然，镇子里敢来这座塔里卖东西的商人只有老夫一个！",
                    "\t[勇者,hero]不对，只是在为钱铤而走险吧......",
                    "\t[商人,trader]咳咳......闲谈就到此为止，老夫看得出来，你的力量就勇者的标准而言很一般呢，这种程度的实力或许连第一区域都无法通过喔。",
                    "\t[勇者,hero]所以接下来老伯你会送我一把神圣剑吗？",
                    "\t[商人,trader]不不不，老夫只是个小商人，拿不出那种档次的好货。不......不要用那种期待的眼神盯着我。",
                    "\t[商人,trader]不过如果是宝石的话，老夫倒是可以批量卖给你，当然，价格公道童叟无欺。",
                    "\t[商人,trader]......看你一副什么都不懂的样子，老夫还是先跟你介绍下宝石的存在吧。",
                    "\t[商人,trader]所谓宝石，就是魔塔里陈年积淀的魔力具象化所产生的特殊产物。",
                    "\t[商人,trader]这些宝石会赋予捏碎者强健的体魄以及惊人的力量。",
                    "\t[商人,trader]有些稀有的宝石甚至还能在使用者周围形成护盾，来有效抵御敌人的伤害。",
                    "\t[商人,trader]红色宝石能提升1点攻击，蓝色宝石能提升1点防御，稀有的绿色宝石能提升5点护盾。",
                    "\t[商人,trader]桀桀桀桀......由于魔物跟宝石的魔力不兼容，所以这些宝贵的存在才得以在魔塔里留存至今，这也正是商机所在。",
                    "\t[勇者,hero]虽然不大听得懂，总之拿多了对身体没坏处对吧！",
                    "\t[商人,trader]......差不多就是这个意思了。",
                    "\t[商人,trader]我在这个区域里收集了很多颗宝石，如果你有需求的话随时都可以来找老夫。",
                    "\t[勇者,hero]嗯！",
                    {
                        "type": "setValue",
                        "name": "flag:talkedWith3FShop",
                        "value": "1"
                    }
                ],
                "false": [
                    {
                        "type": "if",
                        "condition": "(flag:buy3Fcnt<7)",
                        "true": [
                            {
                                "type": "choices",
                                "text": "\t[商人,trader]桀桀桀桀，勇者大人，宝石要伐？价格公道，童叟无欺！",
                                "choices": [
                                    {
                                        "text": "购买红宝石（10金币）",
                                        "action": [
                                            {
                                                "type": "if",
                                                "condition": "(status:money>=10)",
                                                "true": [
                                                    {
                                                        "type": "setValue",
                                                        "name": "status:money",
                                                        "operator": "-=",
                                                        "value": "10"
                                                    },
                                                    {
                                                        "type": "setValue",
                                                        "name": "status:atk",
                                                        "operator": "+=",
                                                        "value": "1"
                                                    },
                                                    {
                                                        "type": "setValue",
                                                        "name": "flag:buy3Fcnt",
                                                        "operator": "+=",
                                                        "value": "1"
                                                    },
                                                    "\t[商人,trader]桀桀桀桀......勇者大人......祝你武运昌隆。"
                                                ],
                                                "false": [
                                                    "\t[商人,trader]你的金币不足！",
                                                    {
                                                        "type": "continue",
                                                        "n": 1
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "text": "购买蓝宝石（10金币）",
                                        "action": [
                                            {
                                                "type": "if",
                                                "condition": "(status:money>=10)",
                                                "true": [
                                                    {
                                                        "type": "setValue",
                                                        "name": "status:money",
                                                        "operator": "-=",
                                                        "value": "10"
                                                    },
                                                    {
                                                        "type": "setValue",
                                                        "name": "status:def",
                                                        "operator": "+=",
                                                        "value": "1"
                                                    },
                                                    {
                                                        "type": "setValue",
                                                        "name": "flag:buy3Fcnt",
                                                        "operator": "+=",
                                                        "value": "1"
                                                    },
                                                    "\t[商人,trader]桀桀桀桀......勇者大人......祝你武运昌隆。"
                                                ],
                                                "false": [
                                                    "\t[商人,trader]你的金币不足！",
                                                    {
                                                        "type": "continue",
                                                        "n": 1
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "text": "不了，谢谢老伯",
                                        "action": [
                                            {
                                                "type": "exit"
                                            }
                                        ]
                                    }
                                ]
                            }
                        ],
                        "false": [
                            "\t[商人,trader]桀桀桀桀......勇者大人，你对于能力的渴求欲可真是旺盛啊。",
                            "\t[商人,trader]你激进的战斗方式让老夫回想起了自己不堪回首的曾经。",
                            "\t[商人,trader]过度追求力量，会导致迷失自我。",
                            "\t[商人,trader]但有时候这也并不是一件坏事。",
                            {
                                "type": "sleep",
                                "time": 500
                            },
                            "\t[勇者,hero]......感觉这人气场完全变了啊。",
                            "\t[商人,trader]老夫这里正好有一颗珍藏多年的特殊宝石，在你手里大概能派得上用场。",
                            {
                                "type": "setValue",
                                "name": "item:I1445",
                                "value": "1"
                            },
                            "\t[勇者,hero]虽然我完全听不懂，但还是谢谢老伯了！",
                            "\t[商人,trader]桀桀桀桀......斗志满满，年轻真好啊，唉。",
                            "\t[商人,trader]转手这种特殊的宝石会引起区域守卫的注意，老夫还是先溜为妙。",
                            "\t[商人,trader]祝你好运，勇者大人，老夫会在更高层的区域里期待与你的再次邂逅。",
                            {
                                "type": "hide",
                                "remove": true
                            }
                        ]
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "7,6": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,12": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1, 22, 23, 21,  1,203,202,201,  1, 32,  0,123,  1],
    [  1, 27, 27, 28,  1, 35,  1, 86,  1, 32,  0,  0,  1],
    [  1, 32, 32, 32,  1,  1,122,  0,  1,  1, 84,  1,  1],
    [  1,  1, 83,  1,  1,  0,  0,  0,209,210,  0, 32,  1],
    [  1, 27, 21,201,202,205,  1,  1,  1,  1, 82,  1,  1],
    [  1,  1, 81,  1,  1, 86,  1, 87,  0,202,  0, 28,  1],
    [  1, 31,201,  0,  1, 27,  1, 46,  0,  1,201,  0,  1],
    [  1,210,  1,  0,202, 21,  1,  0,201, 81,  0, 32,  1],
    [  1,  0, 81,  0,  1, 81,  1, 82,  1,  1, 81,  1,  1],
    [  1, 28,  1,201,  1,  0,  0,  0,201, 21, 22,121,  1],
    [  1, 22, 86,  0, 81,  0,124,  0,  1, 45,1265, 27,  1],
    [  1,  1,  1,  1,  1,  1, 88,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

]
}