main.floors.MT11=
{
    "floorId": "MT11",
    "title": "主塔 11 层",
    "name": "11",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "4,10": [
            "\t[小妖精,fairy]......",
            "\t[勇者,hero]......",
            "\t[小妖精,fairy]......",
            "\t[勇者,hero]我知道妖精小姐想说什么。",
            "\t[勇者,hero]我没有膨胀也没有被你刮目相看。",
            "\t[勇者,hero]我个废柴勇者完全靠运气来到这里可真是抱歉了啊。",
            "\t[小妖精,fairy]啧，把咱想说的话都说完了。",
            "\t[小妖精,fairy]其实你也不用这样妄自菲薄啦，你的实力并不弱，而且你有着其他勇者所没有的东西。",
            "\t[勇者,hero]什么东西？比如俊美的长相之类的？",
            "\t[小妖精,fairy]爱说垃圾话这一点倒是完全没变呢，幸好你还是以前的你。",
            "\t[小妖精,fairy]首先，欢迎来到魔塔的第二区域，目前为止你是第一个到达这里的勇者。",
            "\t[小妖精,fairy]先别膨胀！这并不能说明任何事情，你也就比其他人多活了几层而已。",
            "\t[勇者,hero]妖精小姐喜欢说丧气话这一点也完全没变啊......",
            "\t[小妖精,fairy]之前咱说过，魔塔十层为一个区域。从一个区域进入下一个区域后，魔物的强度会上升不止一个档次。",
            "\t[小妖精,fairy]第二区域由鬼帝镇守，以往光是这一点就足以吓退绝大多数妄图挑战魔塔的人。",
            "\t[勇者,hero]喂在进塔之前妖精小姐你根本没告诉我们这个消息好吗？",
            "\t[勇者,hero]不过话说回来？鬼帝是谁？跟骷髅将军比起来实力如何？",
            "\t[小妖精,fairy]骷髅将军的实力在这个区域只能勉强算个小喽啰，跟鬼帝比较的资格都没有。",
            "\t[勇者,hero]......这也太夸张了吧？光是打败那个骷髅队长就差点要了我的小命啊！",
            "\t[小妖精,fairy]并不夸张，每个区域之间魔物能力的跨度都大的惊人，区域头目之间的能力差距自然也特别大。",
            "\t[小妖精,fairy]但鬼帝是个例外。",
            "\t[小妖精,fairy]如果第一区域与第三区域头目之间的跨度是史莱姆到骷髅战士的话，那么与鬼帝相比，便是史莱姆到魔龙。",
            "\t[勇者,hero]喂喂这根本就不符合常理啊！这样一来无论是谁都不可能通过这个区域吧？",
            "\t[小妖精,fairy]鬼帝就是这样不合常理的存在。",
            "\t[小妖精,fairy]以他的实力就算直接去第五区域当魔王近卫军都绰绰有余，但没人知道为什么他要异常固执地镇守第二区域。",
            "\t[小妖精,fairy]这也是导致第二区域至今无人通过的原因之一，鬼帝本身就代表着不可战胜。",
            {
                "type": "sleep",
                "time": 500
            },
            "\t[勇者,hero]......",
            "\t[小妖精,fairy]你这家伙竟然没说“我要回老家种田”诶！看来在上一个区域你真的经历了不少事情啊。",
            "\t[勇者,hero]我倒是想回家种田，可是我现在有必须要弄清楚的事情，所以我会拿下这个区域，继续前进。",
            "\t[小妖精,fairy]////哼......区区废柴勇者，若无其事耍什么帅啊。",
            "\t[小妖精,fairy]那咱也不好多说什么了，祝你能活得久一点。",
            "\t[小妖精,fairy]哦对了，能够大幅度提升你实力的银剑在14楼，银盾在16楼。",
            "\t[小妖精,fairy]在得到新装备之前尽量减少跟该区域魔物作战的次数，希望这些信息对你有帮助。",
            "\t[小妖精,fairy]唉，也不知道下次见到的你是死是活，干脆先对你说一句一路走好吧。",
            "\t[勇者,hero]......那我还真是谢谢你全家了啊！",
            {
                "type": "hide",
                "remove": true
            }
        ],
        "4,4": [
            "\t[普通老人,man]欢迎来到第二区域。",
            "\t[普通老人,man]你是第一个抵达这里的短命鬼。",
            "\t[勇者,hero]这个称呼也太恶意了吧！",
            "\t[普通老人,man]我来讲解一下这个区域需要注意的几个要点。",
            "\t[普通老人,man]你看到地面上的网状物了吗？那是从魔塔地下层蔓延至此，浸入地板的熔岩，只要踩中就会损失生命值。",
            "\t[普通老人,man]本区域头目的两位手下为了阻止你们通过，创造了许多个自己的分身藏在各层暗处伏击。",
            "\t[普通老人,man]这些分身各有特殊能力，追魂会用黑暗混淆你的视觉，导致你无法通过肉眼感知到它的存在。",
            "\t[普通老人,man]哦，对了。由于某种神秘力量的影响，追魂的分身已经无法通过黑暗混淆你的视觉了。",
            "\t[普通老人,man]现在的他就是个没有属性的白板瓜皮，你随便锤。",
            "\t[勇者,hero]......这个神秘力量，对我真好啊。",
            "\t[普通老人,man]成群结队的鬼奴最为致命，你通过两个鬼奴之间时会被直接削减一半生命值。",
            "\t[普通老人,man]这个区域的魔物排布看似松散，实则暗藏杀机与陷阱，务必小心。",
            "\t[普通老人,man]15楼封印着一件专门对付分身系怪物的法器，务必尽快入手。",
            "\t[勇者,hero]嗯，我知道了。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "1,11": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1, 32,214, 11,213,  0, 87,  1,  1, 27, 22, 27,  1],
    [  1, 81,  1, 82,  1,  1,234,  1,  1, 27,208, 27,  1],
    [  1,213,233,  0,  1,208,  0,208,  1,  1, 81,  1,  1],
    [  1, 34,  1,  0,121,  1,213,  1, 27,  1,213, 32,  1],
    [  1, 21,  1,  0,  0,  0,  0,207,235,255, 11,  1,  1],
    [  1,  1, 27,  1,  1, 11,  1,  1, 86,  1,233, 28,  1],
    [  1, 21, 33,234, 82,  0,233, 81,  0,235,  0,  1,  1],
    [  1,  1, 28,  1,  1, 81,  1,  1,233,  1,255,  1,  1],
    [  1,  1, 22,  1,  0,  0, 21,  1,234,  1, 28,  1,  1],
    [  1,  1,  1,  1,124,  1,  1,  1,205, 82, 27, 21,  1],
    [  1, 88,  0,  0,  0, 81, 58,  1, 32,  1, 21,  1,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

]
}