main.floors.MT16=
{
    "floorId": "MT16",
    "title": "主塔 16 层",
    "name": "16",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "11,3": [
            "\t[小妖精,fairy] ......",
            "\t[勇者,hero]我个废柴勇者完全靠运气来到这里可真是抱歉抱歉再抱歉了啊",
            "\t[小妖精,fairy]咱就不挖苦你了，怎样？对这个区域的体感如何",
            "\t[勇者,hero]到处都是陷阱跟机关的预感，不过仔细思考的话还是能看到一线生机",
            "\t[小妖精,fairy]啧，真是游刃有余呢",
            "\t[小妖精,fairy]不过你先别放松警惕，鬼帝似乎已经察觉到了你的气息，在这几层里紧急布置了更严密的防守",
            "\t[小妖精,fairy]咱之前从没见过鬼帝如此慌张的样子，看起来他好像在惧怕着什么",
            "\t[勇者,hero]那可真奇怪啊，强如鬼帝这种程度的存在，应该已经没有什么能让他害怕的东西了吧",
            "\t[小妖精,fairy]盯......",
            "\t[勇者,hero]连最弱的绿史莱姆见到我都是气势汹汹地扑过来的，妖精小姐你是知道的吧",
            "\t[小妖精,fairy]说的也是，身为区域头目的鬼帝怎么可能会把你一个卑微又弱小还没什么志向的怂包放在眼里呢",
            "\t[勇者,hero]喂喂！这一大串恶意满满的前缀是怎么回事，太过分了吧",
            "\t[小妖精,fairy]鬼帝的心思大概只有他自己还有那两个名为鬼奴和追魂的手下能揣摩了",
            "\t[小妖精,fairy]总之，从这层开始你要多加小心，你面对的是一个实力远强于你却非要耍小手段的对手",
            "\t[勇者]那道似曾相识的雷击，还有鬼帝对我的特殊关照，总感觉谜团越来越多了啊",
            "\t[小妖精,fairy]哦对了，银盾跟银剑都是超脱这个区域级别的传奇装备，都拥有极具价值的特殊能力",
            "\t[小妖精,fairy]银剑的便利你应该已经体会过了，银盾的特殊能力是让熔岩网的伤害变成十分之一，越早拿到它你在这个区域的路就越顺畅",
            "\t[勇者,hero]为什么你总是把最有用的信息放到最后才说啊",
            "\t[小妖精,fairy]咱乐意啊，rua~",
            "\t[勇者,hero]任性的丫头......",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "1,11": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "11,1": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  1,  1,  1],
    [  5,  1,  1,  1,  1,  1,  1,  1,  5,  5,  1, 88,  1],
    [  5,  1, 38,  1, 11, 11, 11,  1,  1,  1,  1,  0,  1],
    [  5,  1, 11, 11, 11,  1, 11, 11, 11,  1,  1,124,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1, 11,213, 82,  0,  1],
    [  1, 11, 11, 11, 11,  1, 11, 11, 11,  1,  1,235,  1],
    [  1,255,  1,  1, 11, 11, 11,  1, 33,  1,  0,  0,  1],
    [  1,213,  1,  1,  1,207,  1,  1,  1,  1, 81,  1,  1],
    [  1, 33,234, 81,  0,235,  0,  0,214,  0,213, 58,  1],
    [  1,  1, 82,  1,213,  1, 32,213,  1,  1,214,  1,  1],
    [  1, 27, 28,  1, 11, 22,  1, 11,  1, 27, 29, 28,  1],
    [  1, 87,  0,  1,  1,233, 81, 34,  1, 58, 21, 34,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

]
}