main.floors.MT18=
{
    "floorId": "MT18",
    "title": "主塔 18 层",
    "name": "18",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": [
            "\t[普通老人,man]在魔塔里，史莱姆的确是最低等级的魔物，但是有一种史莱姆是个例外",
            "\t[普通老人,man]它就是疫病化身，吸收了无数怨念与疫病，身体结构发生了改变，几乎一触碰就会染上各种致命的传染病",
            "\t[普通老人,man]最基础的解毒剂是无法解除跟这种魔物战斗以后的后遗症的",
            "\t[普通老人,man]我听说这个区域的隐藏空间里有这样一种灵药，能够根治白冰，或许能够派上用场",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "11,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,12": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,1276,  1,208, 81,  1, 33,  1,  1,208, 82, 88,  1],
    [  1, 34, 82,1276,  0,214,121,214, 81,1283,  0,  0,  1],
    [  1,1283,  1,208,  1,  1,  0,  1,  1,208,  1,  1,  1],
    [  1,  1,1276,  1,1276,  1, 85,  1,1283,  1,1283,  1,  1],
    [  1, 21,213,  0,  0,  0,  0,  0,  0,  0,213, 21,  1],
    [  1,  1,  0,  1,  0,  0,  1,  0,  0,  1,  0,  1,  1],
    [  1, 34,213,  0,  0,  0,  0,  0,  0,  0,213, 34,  1],
    [  1,  1,  0,  1,  0,  0,  1,  0,  0,  1,  0,  1,  1],
    [  1, 28,213,  0,  0,  0,  0,  0,  0,  0,213, 27,  1],
    [  1,  1,  0,  1,  0,  1,248,  1,  0,  1,  0,  1,  1],
    [  1, 28,  0,214,  0,  1,  0,  1,  0,214,  0, 27,  1],
    [  1,  1,  1,  1,  1,  1, 87,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

]
}