main.floors.MT20=
{
    "floorId": "MT20",
    "title": "主塔 20 层",
    "name": "主塔 20 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        "\t[勇者,hero]这层的氛围有点不对劲......怎么回事？",
        {
            "type": "closeDoor",
            "id": "specialDoor",
            "loc": [
                6,
                1
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,4": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[勇者,hero]哇！居然是血影的幼崽！",
                "\t[血影幼崽,N1586]......（奇怪的吼叫）",
                "\t[勇者,hero]看起来并没有敌意......应该是来帮我的吧。",
                "\t[血影幼崽,N1586]......（奇怪的吼叫）",
                "\t[勇者,hero]看起来像在对我表示感谢的样子......没办法交流，但还是谢谢你们了。",
                "\t[血影幼崽,N1586]......谢......谢（奇怪的吼叫）",
                {
                    "type": "hide",
                    "remove": true,
                    "time": 500
                }
            ]
        }
    },
    "changeFloor": {
        "6,12": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,0": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,7": [
            "\t[鬼奴,E572]你果然不是一般的角色。",
            "\t[鬼奴,E572]但你应该察觉到了，这层经过鬼帝大人的特殊处理，通往下个区域的道路已经被封死了。",
            "\t[勇者,hero]什么？竟然耍这种小手段？！",
            "\t[鬼奴,E572]哈哈哈哈！能看到你这副惊愕却又无能为力的表情，我的牺牲也不算白费了。",
            "\t[勇者,hero]可恶......现在该怎么办才好......",
            {
                "type": "openDoor",
                "loc": [
                    6,
                    1
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    8,
                    10
                ],
                "floorId": "MT19"
            },
            {
                "type": "show",
                "loc": [
                    [
                        6,
                        11
                    ]
                ],
                "floorId": "MT19"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,5": [
            "\t[勇者,hero]......你是？！那些鬼奴分身的正体吗？",
            "\t[鬼奴,E572]没想到我们一路上设置了那么多阻碍，还是被你突破到这里来了。",
            "\t[鬼奴,E572]果然，跟鬼帝大人猜测的一样，你并不像外表看起来那样弱小不堪。",
            "\t[勇者,hero]比起这个，你们的鬼帝大人在哪？",
            "\t[鬼奴,E572]嗯.........................（盯）",
            "\t[勇者,hero]（可恶......这家伙的眼神真让人不舒服......）",
            "\t[鬼奴,E572]恕我直言，以你现在的实力，连站在鬼帝面前的资格都没有。",
            "\t[勇者,hero]......这句话我居然反驳不了。",
            "\t[鬼奴,E572]就连身为鬼帝大人最强手下的我也很疑惑，为什么鬼帝大人会对你一个微不足道的小勇者那么上心？",
            "\t[鬼奴,E572]也许我得亲身来测测你的实力，拔剑吧，弱小不堪的勇者。",
            "\t[勇者,hero]呵呵，是不是弱小不堪，你没试过怎么敢如此断言？",
            "\t[鬼奴,E572]我拥有鬼帝大人赏赐的魔眼，可以窥探一切真实与谎言。",
            "\t[鬼奴,E572]你的实力，你的想法，甚至连你的身世我都能看得一清二楚。",
            "\t[鬼奴,E572]你刚才的发言，只是给自己撑场面的假话而已。其实你内心深处十分抵触与我战斗。",
            "\t[鬼奴,E572]这说明你会在此地进入败北的结局。",
            "\t[勇者,hero]是吗？我倒是搞不懂你们这群热衷战斗的家伙一个个脑子里到底在想什么。",
            "\t[鬼奴,E572]这是只有弱者才会说出口的可笑发言。",
            "\t[勇者,hero]废话就到此为止吧，我的战意是不会因为你的泼冷水而抹消的。",
            "\t[勇者,hero]其实从我最开始就猜到了你的意图，只可惜你的毒舌指数跟妖精小姐比起来，差距大概就像史莱姆跟魔龙吧。",
            "\t[鬼奴,E572]可恶......被看穿了吗......",
            "\t[鬼奴,E572]竟然能在我的蛊惑面前保持理智，如鬼帝大人所说，你果然不简单。",
            "\t[鬼奴,E572]不过，可别小瞧身为鬼帝大人最强手下的我。要战便战吧！",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  4,  4,  4,  4,  4,  1, 88,  1,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  1,  0,  1,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  1,  0,  1,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  1,  0,  1,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  1,1586,  1,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  1,  1, 83,  1,  1,  4,  4,  4,  4],
    [  4,  4,  4,  4,  1,  0,  0,  0,  1,  4,  4,  4,  4],
    [  4,  4,  4,  4,  1,  0,572,  0,  1,  4,  4,  4,  4],
    [  4,  4,  4,  4,  1,  0,  0,  0,  1,  4,  4,  4,  4],
    [  4,  4,  4,  4,  1,  1,  1,  1,  1,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  4,  0,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  4, 87,  4,  4,  4,  4,  4,  4]
],
    "bgmap": [

],
    "fgmap": [

],
    "weather": [
        "rain",
        6
    ]
}