main.floors.MT21=
{
    "floorId": "MT21",
    "title": "主塔 21 层",
    "name": "21",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,9": [
            "\t[小妖精,fairy]呦，从地下层活着回来了啊。",
            "\t[小妖精,fairy]问问你身上那股腥臭味，你应该已经跟数不清的血影幼崽战斗过了吧？",
            "\t[勇者,hero]别说了......不要让我回想起那些恶心又粘稠的怪物。",
            "\t[小妖精,fairy]那这个话题就到此为止，欢迎来到第三区域，废柴勇者。",
            "\t[勇者,hero]跟暗妖精小姐比起来，你的服务态度简直给十个差评都不过分啊......",
            "\t[小妖精,fairy]哈啊？有了新欢就忘了咱这个旧爱吗？！没想到你是这样的废柴勇者！",
            "\t[勇者,hero]你在说什么蠢话啊......比起这个，我现在已经得知了鬼帝的去向，他现在已经逃到第四区域......或者更高的楼层了。",
            "\t[小妖精,fairy]是吗？那他可真够狼狈的，第三区域在魔塔里是各种族魔物中的武者所聚集的地方。",
            "\t[小妖精,fairy]这些魔物武者追求力量与平等，憎恶分明，充满正义感，他们都有一个共同的特点，那就是极度排斥其他区域的同类。",
            "\t[勇者,hero]充满正义感？你这些词真的可以用来形容魔物吗？",
            "\t[小妖精,fairy]你那些老旧的观点也是时候该摒弃了吧......魔物并不都是邪恶的，恰恰相反，他们中的大多数都很善良，爱好和平。",
            "\t[勇者,hero]善良？爱好和平？妖精小姐你脑子是不是坏掉了？",
            "\t[小妖精,fairy]你脑子才坏掉呢！笨蛋！......算了，你从小接受的教育应该已经给你灌输了无数魔物至恶的观念，这种观念可不是咱三言两语就能改变的。",
            "\t[勇者,hero]......我只是很疑惑，刚才自发到20层帮我用熔岩开道的血影幼崽也是，它们也并不是无法交流，只知道杀人的存在。",
            "\t[勇者,hero]但是，我是抱着讨伐魔物这个目的才来到魔塔的，我不想因为魔物本性善良这个侥幸想法就失去挥刀的力气。",
            "\t[勇者,hero]你明白我的意思吧？妖精小姐？",
            "\t[小妖精,fairy]也不是完全不能理解，毕竟魔物跟人类历来都是站在对立面的，两族之间的对峙是必定会存在下去的。这个现状并不是咱几个个体就能改变的。",
            "\t[小妖精,fairy]不说这些了，咱刚才说过第三区域的魔物武者是以力量为尊吧？这个区域没有什么好讲的要点，你想通过这里，就得有强劲无比的实力。",
            "\t[小妖精,fairy]还要有一颗永不放弃的心。因为你在这个区域遇到的强敌，会比以往碰到的任何敌人强上数十倍。",
            "\t[勇者,hero]......嗯，虽然有点紧张，但是多少也有些热血沸腾的感觉啊。",
            "\t[小妖精,fairy]骑士剑跟骑士盾分别在22层和25层，这两件装备能大幅提升你的身体能力，务必尽快入手。",
            "\t[小妖精,fairy]那么久照理希望这些信息对你又帮助，前进吧，勇者。",
            "\t[勇者,hero]唉，我果然还是怀念被暗妖精小姐一口一个勇者大人的日子啊......",
            "\t[小妖精,fairy]少啰嗦！咱就算从这里跳下去也不会这样叫你的！略略略！",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1, 33,1276,  1,1283,  1, 87,  1,1276, 21,  1,1276,  1],
    [  1,  1,254, 86, 22,  1,  0,  1,232, 33, 86,395,  1],
    [  1,  1, 81,  1,224,  1,395,  1, 82,  1,  1,227,  1],
    [  1, 33,  0,224,  0,  0,  0,  0,  0,  1,  1,224,  1],
    [  1,  1,767,  1,226,  1,  1,224,  0, 86, 33,1290,  1],
    [  1,1276,1276,  1, 34,  1,1276, 81,  1,  1,  1,1283,  1],
    [  1, 33, 33,  1, 81,  1,  1,395, 33, 22,  1, 22,  1],
    [  1,  1,  1,  1,  0,  0,  0,  0,  0,  1,  1,  1,  1],
    [  1,  4,  4,  1,  1,  1,124,  1,  1,  1,  4,  4,  1],
    [  1,  4,  4,  4,  4,  4,  0,  4,  4,  4,  4,  4,  1],
    [  1,  4,  4,  4,  4,  4, 88,  4,  4,  4,  4,  4,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

]
}