main.floors.MT26=
{
    "floorId": "MT26",
    "title": "主塔 26 层",
    "name": "主塔 26 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,9": [
            "\t[小妖精,fairy]怎么样？第三区域给你的感觉是不是跟其他区域有很大的不同？",
            "\t[勇者,hero]呼......先让我缓缓，每层都有强敌镇守，真的给人一种喘不过气来的感觉啊。",
            "\t[小妖精,fairy]因为这群魔物都崇尚着武者精神，坚持一对一决斗来证明自己的实力，此外由于这群魔物都非常正直，所以这个区域的陷阱数量也是零。",
            "\t[勇者,hero]正直过头了啦......都差点让我产生它，它们不是魔物的错觉了，简直就是一个一个活生生的人类战士。",
            "\t[小妖精,fairy]嘻嘻......咱说的那些话，你差不多已经理解了吧，并不是所有魔物都像你之前碰到的那样阴险狡诈，嗜血暴戾。",
            "\t[勇者,hero]......即便如此，我也知道它们仍然是魔物，这就是我挥剑的理由。",
            "\t[小妖精,fairy]唉......真是个顽固的笨蛋。",
            "\t[小妖精,fairy]那咱也不好多说什么了，继续前进吧，勇者。",
            "\t[勇者,hero]如果是暗妖精小姐的话，她肯定会叫我......",
            "\t[小妖精,fairy]不叫！闭嘴！",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,0": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1, 87,  1,  1,  1,  1,  1,  1],
    [  1,1276,1276,1276,  1,  1,  0,  1,1276,224,232,1276,  1],
    [  1, 33, 33, 23,  1,  1,767,  1, 22,  1, 81,  1,  1],
    [  1,  1, 84,  1,  1,1167, 82,227,  1,1167,  0, 33,  1],
    [  1,  0,  0,254,1167, 34,  1,  0,  1,227,  1,232,  1],
    [  1,224,  1,1276,  1,1276,  1,  0,254,  0, 86,224,  1],
    [  1,1167,1167,  1,1276,  1,  1,395,  1,224,  1,1283,  1],
    [  1,  1,1167,224, 33, 81,254,  0,  1, 34,  1, 34,  1],
    [  1,  1,  1,  1,  1,  1, 82,  1,  1,  1,  1,  1,  1],
    [  1,  4,  4,  1,  1,  1,124,  1,  1,  1,  4,  4,  1],
    [  1,  4,  4,  4,  4,  4,  0,  4,  4,  4,  4,  4,  1],
    [  1,  4,  4,  4,  4,  4, 88,  4,  4,  4,  4,  4,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "05.Innerlink.wav"
}