main.floors.MT29=
{
    "floorId": "MT29",
    "title": "主塔 29 层",
    "name": "主塔 29 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,6": [
            "\t[盗贼,thief]嘿！哥们儿！你终于来到这里了？",
            "\t[勇者,hero]终于？难不成你在等我吗？",
            "\t[盗贼,thief]当然啊！等你出地下层都不知等了多久，可让我好等啊。",
            "\t[勇者,hero]你怎么知道我去地下层了？",
            "\t[盗贼,thief]这......你身上那些粘液证明你跟血影战斗过了吧，这个并不是难以推测的事情。",
            "\t[盗贼,thief]别管这些了！赶快战胜这个区域的头目，我们继续向第四区域进发！",
            "\t[勇者,hero]......嗯。（总觉得这家伙越来越可疑了）",
            "\t[盗贼,thief]就这样，我去挖密道了！我们第四区域再见！你也赶紧前进吧！",
            "\t[勇者,hero]等一下，这个区域的魔物武者非常排斥外族，况且每层都有强敌镇守，你是如何完好无损的到达这里的？",
            {
                "type": "sleep",
                "time": 500,
                "noSkip": true
            },
            "\t[盗贼,thief]......啊哈哈哈哈，你以为我是谁啊？我可是无所不能无所不知的杰克大盗哦！",
            "\t[盗贼,thief]我当然是一路挖密道来到这里的啊！区区守卫根本就拦不住我！",
            "\t[勇者,hero]那......你为什么每个区域都要催促我打败头目再挖密道上楼？你的挖密道本领既然这么高超，应该自己就能探秘整座魔塔吧？",
            "\t[勇者,hero]我直说了......为什么你要等我？我以前认识你吗？",
            "\t[勇者,hero]以及......你究竟是谁？",
            "\t[盗贼,thief]......",
            "\t[盗贼,thief]我确实对你隐瞒了一些事情，因为有些事情......我还不能说。",
            "\t[盗贼,thief]但我是绝对不会加害于你的，这一路上我也对你提供了不少帮助不是吗？",
            "\t[勇者,hero]嗯，说起来没有你三番五次帮我的话，我根本就没可能抵达这里。",
            "\t[盗贼,thief]这就对了！我们是朋友对吧？是朋友就应该毫无保留地互相信任啊！",
            "\t[盗贼,thief]别想太多了，继续前进吧。到了下个区域，我就会把我隐瞒的一切都告诉你。",
            "\t[勇者,hero]好吧......你自己也要多加小心啊。",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "6,0": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,11": {
            "floorId": "MT30",
            "loc": [
                6,
                2
            ],
            "direction": "down"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1, 88,  1,  1,  1,  1,  1,  1],
    [  1,  4,  4,  4,  4,  4,  0,  4,  4,  4,  4,  4,  1],
    [  1,  4,  4,  4,  4,  4,  0,  4,  4,  4,  4,  4,  1],
    [  1,  1,  1,  1,  1,  1,  0,  1,  1,  1,  1,  1,  1],
    [  1,  1, 23, 21, 22,  1,  0,  1,1276,1276,1276,  1,  1],
    [  1,  1, 34, 34, 34, 85,  0, 85,1283,1283,1283,  1,  1],
    [  1,  1, 33, 33, 33,  1,123,  1,1290,1290,1290,  1,  1],
    [  1,  1,  1,  1,  1,  1,  0,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1, 33, 82,  0, 81, 34,  1,  1,  1,  1],
    [  1,  4,  4,  1,  1,  1,  0,  1,  1,  1,  4,  4,  1],
    [  1,  4,  4,  4,  4,  4,  0,  4,  4,  4,  4,  4,  1],
    [  1,  4,  4,  4,  4,  4, 87,  4,  4,  4,  4,  4,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "05.Innerlink.wav"
}