main.floors.MT33=
{
    "floorId": "MT33",
    "title": "主塔 33 层",
    "name": "主塔 33 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,9": [
            "\t[勇者,hero]妖精小姐！你终于出现了！",
            "\t[勇者,hero]赶快告诉我这个区域究竟是怎么回事吧，怎么一个魔物都没有？",
            "\t[勇者,hero]就算是集体翘班去撸串好歹也留几只装模作样的镇守一下吧？",
            "\t[小妖精,fairy]不对......这个区域......完全不对。",
            "\t[小妖精,fairy]不应该是这样的......有什么地方......到底是什么地方出了问题......",
            {
                "type": "sleep",
                "time": 600,
                "noSkip": true
            },
            "\t[勇者,hero]妖精小姐？你怎么了？在自言自语什么呢？",
            "\t[小妖精,fairy]......",
            "\t[勇者,hero]究竟发生了什么啊？妖精小姐，你怎么突然神神叨叨的？",
            "\t[勇者,hero]快像往常一样用恶毒的话语挖苦我啊！",
            {
                "type": "vibrate",
                "direction": "horizontal",
                "time": 2000,
                "speed": 10,
                "power": 10
            },
            "\t[小妖精,fairy]......放心吧，咱没事。",
            "\t[小妖精,fairy]反倒是你，差不多该让这场勇者闹剧到此为止了吧？",
            "\t[勇者,hero]......什么？妖精小姐，这好像不在你的恶毒话语范围内啊......？",
            "\t[小妖精,fairy]你是......很珍惜自己性命的对吧？",
            "\t[小妖精,fairy]如果你还想活命的话，就听咱一句劝吧。",
            "\t[小妖精,fairy]不要再继续走下去了，现在往回走还来得及。",
            "\t[勇者,hero]......？！可是，公主还被囚禁在这座塔里！不继续前进的理由根本就不存在啊！",
            "\t[小妖精,fairy]咱会确保公主的安危，所以......不要再插手这件事了。",
            "\t[小妖精,fairy]快逃吧......趁他还没有察觉到你的到来，逃的越远越好。",
            "\t[小妖精,fairy]然后，永生不踏入魔塔半步。",
            {
                "type": "hide",
                "remove": true
            },
            "\t[勇者,hero]不等我问完就消失不见了......可恶！",
            "\t[勇者,hero]......不对劲，这一切都太不对劲了。",
            "\t[勇者,hero]虽然你的那些话的确让我起了一身鸡皮疙瘩，但我还是会坚持继续前进的。",
            "\t[勇者,hero]因为我有就算死也非得调查清楚的事情。"
        ]
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5],
    [  5,1276,  1,  0,  0,  0,  0,  0,  0,  0,  0, 87,  5],
    [  5,  0,  0,  0,  0,  5,  5,  0,  0,  5,  5,  5,  5],
    [  5, 22, 34,  5,1283,  5,  5,  0,  0, 33, 34,1283,  5],
    [  5, 81,  5,  5,  5,  5,  5,  5, 81,  5,1276,  5,  5],
    [  5, 21, 34,  5, 33,  5,  5,  0,  0,  5,  5,1290,  5],
    [  5,  5,  5,  5, 82,  5,  5,  0,  0,  0, 21,1276,  5],
    [  5,  5,  5,  5,  0,  0,  5,  0,  0,  1, 34,  1,  5],
    [  5,  5,  5,  5,  0,  0,  0,  0,  0,  1,  1,  1,  5],
    [  5,  4,  4,  1,  1,  1,124,  1,  1,  1,  4,  4,  5],
    [  5,  4,  4,  4,  4,  4,  0,  4,  4,  4,  4,  4,  5],
    [  5,  4,  4,  4,  4,  4, 88,  4,  4,  4,  4,  4,  5],
    [  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "TheIsland.mp3"
}