main.floors.MT36=
{
    "floorId": "MT36",
    "title": "主塔 36 层",
    "name": "36",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "moveHero",
            "steps": [
                "up:2"
            ]
        },
        {
            "type": "closeDoor",
            "id": "specialDoor",
            "loc": [
                6,
                10
            ]
        },
        "\t[勇者,hero]你是......鬼帝？！",
        "\t[鬼帝,skeletonKing]没想到我们竟然会以这样的方式碰面。",
        "\t[鬼帝,skeletonKing]真是讽刺至极啊......",
        "\t[勇者,hero]这种让人无法忽略的气场......你明明比我见过的任何魔物......甚至包括血影本体都强。",
        "\t[勇者,hero]为什么你要这么躲着我？",
        "\t[鬼帝,skeletonKing]原因很简单，我不想跟你交手。",
        "\t[鬼帝,skeletonKing]虽然我知道自己肯定会获胜。",
        "\t[勇者,hero]......那究竟是为何？",
        "\t[鬼帝,skeletonKing]因为我不想对自己的同类出手。",
        "\t[勇者,hero]......什么？？",
        "\t[勇者,hero]你开什么玩笑？！我可是人类啊！货真价实的人类啊！",
        "\t[勇者,hero]我怎么可能会是一个魔物的同类？？你到底在说什么？？",
        "\t[鬼帝,skeletonKing]冷静下来，听我说完。",
        "\t[鬼帝,skeletonKing]你有没有发现，其实我们两个人很像。",
        "\t[勇者,hero]很像？你眼睛还是脑子出问题了吗？？",
        "\t[鬼帝,skeletonKing]先听我说完，你知道吗。",
        "\t[鬼帝,skeletonKing]其实我原本也是一名勇者。",
        "\t[勇者,hero]？！",
        "\t[鬼帝,skeletonKing]不过我是魔物的勇者，而你是人类的勇者。",
        "\t[鬼帝,skeletonKing]你的勇者导师应当教过你吧，勇者之所以与其他孱弱的人类不同，是因为勇者本身拥有着无限的可能性。",
        "\t[勇者,hero]这只不过是一句用来激励我们的空话罢了，无限的可能性是需要自己用双手去创造的！",
        "\t[鬼帝,skeletonKing]不，其实可能性是因人而异的。",
        "\t[鬼帝,skeletonKing]有的人生来不是勇者，那他再怎么拼命地与魔物战斗，最终也会败在比他强的魔物手下。",
        "\t[鬼帝,skeletonKing]但勇者不一样，勇者的体质生来就与其他人类有别，勇者的能力会随着战胜越来越多的魔物变得更强，这个强大是不存在上限的。",
        "\t[勇者,hero]......区区一个魔物，为什么对人类的事情这么了解？",
        "\t[鬼帝,skeletonKing]人类跟魔物本来就没有什么本质上的区别，你我都是天生的稀有勇者体质，所以我才会说我们两个人很像。",
        "\t[勇者,hero]......稀有勇者体质？那是什么？",
        "\t[鬼帝,skeletonKing]你一直在享受着这种体质带来的便利却丝毫不自知，真是可悲。",
        "\t[鬼帝,skeletonKing]你知道为什么你的能力会变得越来越强吗？从当初被史莱姆击败的弱小存在，逐渐成长为现在这般能够轻松击败魔神武者的真正勇者。",
        "\t[勇者,hero]！！......！......当然是因为——",
        "\t[鬼帝,skeletonKing]这可不是一个歌颂爱、正义、毅力与勇气的童话故事。",
        "\t[鬼帝,skeletonKing]还是让我这个你唯一的同类来告诉你真相吧，虽然这真相可能会残酷到让你崩溃。",
        "\t[勇者,hero]......你说吧，如果你敢说半点假话，我这把剑就会斩向你的狗头。",
        "\t[鬼帝,skeletonKing]你就连容易情绪化这一点，也跟曾经的我很像......唉。",
        "\t[鬼帝,skeletonKing]不知你有没有注意到，你每次击杀魔物时，都会有一个名叫“魔力”的数值增长。",
        "\t[勇者,hero]！！......！......的确，不过我到现在都不知道这项数据有什么作用。",
        "\t[鬼帝,skeletonKing]魔力，指代的是灵魂能量，也就是被你杀死的魔物灵魂的总量。",
        "\t[勇者,hero]！！......！......什么？！",
        "\t[鬼帝,skeletonKing]通常来说，灵魂在脱离肉体以后会立刻消散，可是稀有勇者体质拥有一个特殊能力。",
        "\t[鬼帝,skeletonKing]那就是吸收灵魂，来增强自己的实力。",
        "\t[勇者,hero]！！......！......",
        "\t[鬼帝,skeletonKing]你记不记得在第一区域，你是怎么战胜骷髅将军的？那家伙虽然实力不强，但也绝对不是那时的你可以轻易打败的。",
        "\t[勇者,hero]......因为，其他勇者的亡魂把他们的力量分给了我。",
        "\t[鬼帝,skeletonKing]这就是你身为稀有勇者体质的证明，不需要任何媒介跟仪式就能直接取用他人灵魂的力量为自己所用，是不是很便利？",
        "\t[勇者,hero]......可是，我......这不就像是，踩着无数生命的尸体，以他们的灵魂为养分，才走到这一步的吗？",
        "\t[鬼帝,skeletonKing]没错，这就是稀有勇者体质的宿命。",
        "\t[鬼帝,skeletonKing]我曾经的经历跟现在的你，大同小异。",
        "\t[鬼帝,skeletonKing]我也是从最弱小的存在开始战斗，经历过无数次与人类的战争并成为最后的幸存者，一点一点吸收灵魂，才成长到今天这样子的。",
        "\t[鬼帝,skeletonKing]我是这个世界上唯一能理解你的人。",
        "\t[勇者,hero]闭嘴！！......我才不要听你胡言乱语！",
        "\t[勇者,hero]区区魔物！也敢自称勇者！？你们当初是怎样肆虐我们人类的家乡，杀害无数的人类同胞！？少在那里装模作样了！",
        "\t[鬼帝,skeletonKing]这就失去理智，拒绝接受真相了？",
        "\t[鬼帝,skeletonKing]肆虐家乡与屠杀同族这种勾当，你们人类对我们魔物做的也不少吧？",
        "\t[勇者,hero]那......那只是......你给我闭嘴啊啊啊！！！！！",
        "\t[鬼帝,skeletonKing]你以为我们魔物是为什么而战？我们从一开始就不想战斗，我们所做的一切都只不过是在反抗你们人类的侵略而已。",
        "\t[勇者,hero]闭嘴啊啊啊啊！！！！！",
        "\t[鬼帝,skeletonKing]......看来你已经彻底丧失判断能力了。",
        "\t[勇者,hero]杀......我要......杀了你！！！",
        "\t[鬼帝,skeletonKing]......唉，看来逃不过的宿命，果然是终究逃不过的。",
        "\t[鬼帝,skeletonKing]来吧，人类勇者，我以魔物勇者的名义，向你发起挑战！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5],
    [  5,  5,  5,  5,  5,  1, 87,  1,  5,  5,  5,  5,  5],
    [  5,  5,  5,  5,  5,  1,  0,  1,  5,  5,  5,  5,  5],
    [  5,  5,  5,  5,  1,  1, 85,  1,  1,  5,  5,  5,  5],
    [  5,  5,  5,  5,  1,  0,238,  0,  1,  5,  5,  5,  5],
    [  5,  5,  5,  5,  1,  0,  0,  0,  1,  5,  5,  5,  5],
    [  5,  5,  5,  5,  1,  1,  0,  1,  1,  5,  5,  5,  5],
    [  5,  5,  5,  5,  5,  1,  0,  1,  5,  5,  5,  5,  5],
    [  5,  5,  5,  5,  5,  1,  0,  1,  5,  5,  5,  5,  5],
    [  5,  4,  4,  4,  4,  1,  0,  1,  4,  4,  4,  4,  5],
    [  5,  4,  4,  4,  4,  4,  0,  4,  4,  4,  4,  4,  5],
    [  5,  4,  4,  4,  4,  4, 88,  4,  4,  4,  4,  4,  5],
    [  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5]
],
    "bgmap": [

],
    "fgmap": [

]
}