main.floors.MT41=
{
    "floorId": "MT41",
    "title": "主塔 41 层",
    "name": "41",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,9": [
            "\t[暗妖精,N1584]......你好！勇者大人！",
            "\t[勇者,hero]......！",
            "\t[勇者,hero]是暗妖精啊......抱歉，我刚刚差点把你看成妖精小姐。",
            "\t[勇者,hero]为什么暗妖精小姐会来这里？你管理的不是地下区域么？",
            "\t[暗妖精,N1584]我们妖精族关系亲密的人之间是能产生心灵感应的。",
            "\t[暗妖精,N1584]刚才我感应到那傻丫头的灵魂波动很不正常，实在放心不下，于是就上来找你们了。",
            "\t[暗妖精,N1584]那么......小妖精现在在哪？",
            "\t[勇者,hero]......对不起。",
            "\t[暗妖精,N1584]为什么要跟我道歉？勇者大人......",
            "\t[勇者,hero]......她为了保护我......已经......",
            "\t[勇者,hero]这块宝石是我唯一能夺回的东西......",
            "\t[暗妖精,N1584]......",
            "\t[勇者,hero].....对不起，真的很对不起。",
            "\t[勇者,hero]全都是我的错......如果我能再强大一点的话！",
            "\t[暗妖精,N1584]......振作起来，勇者大人。",
            "\t[暗妖精,N1584]......妖精她，直到最后都履行守护精灵的职责吧？......是这样吧？",
            "\t[勇者,hero]......嗯。",
            "\t[暗妖精,N1584]......我啊，一直都憧憬着作为前辈的小妖精，能那么随性地跟人类交谈，虽然嘴巴毒又不坦率，却是个好心肠的滥好人。",
            "\t[暗妖精,N1584]......一直以来，小妖精就像是我的亲姐姐一样......",
            "\t[勇者,hero]......都是我的错。",
            "\t[暗妖精,N1584]勇者大人！千万不要自责！",
            "\t[暗妖精,N1584]你看，连我都没哭......呜呜......",
            "\t[暗妖精,N1584]因为我知道，眼泪是解决不了任何问题的，因为悲伤而止步不前的话，她的性命可就白白浪费了啊......",
            "\t[勇者,hero]别哭了。",
            "\t[暗妖精,N1584]我没有哭！只是......呜呜......",
            "\t[勇者,hero]我会想尽一切办法，哪怕赔上我这条命也要还清欠她的。",
            "\t[勇者,hero]我不想再看到任何妖精的悲伤与眼泪。",
            "\t[暗妖精,N1584]......历史里使用过自灭冲击的妖精从来没有能保住过完整灵魂的，就算被复活，也会失去大部分的记忆......",
            "\t[勇者,hero]一定会有办法救她的！我会游历全世界寻找让她恢复原样的手段！",
            "\t[勇者,hero]所以，振作起来，不要哭。",
            "\t[暗妖精,N1584].....勇者大人，谢谢你。",
            "\t[勇者,hero]不要谢我，我只是在赎罪而已。",
            "\t[勇者,hero]从今以后，我这条命就是你们妖精族的了。",
            "\t[暗妖精,N1584]......！！",
            "\t[勇者,hero]我会用命还清欠她的。",
            "\t[暗妖精,N1584]勇者大人......",
            "\t[勇者,hero]我听说魔塔最高层有一瓶圣水，能够让一切生灵起死回生，如果能够得到它的话，就能唤回她的性命了。",
            "\t[暗妖精,N1584]！！可是！......作为镇塔圣物的圣水如果被拿走的话，这座塔会崩塌的！",
            "\t[勇者,hero]那种事情我才不在乎。",
            "\t[暗妖精,N1584]......",
            "\t[暗妖精,N1584]我也不好阻止你什么......",
            "\t[暗妖精,N1584]勇者大人......我知道你救人心切，但是......不要为此丢弃自我啊。",
            "\t[勇者,hero]自我？我就是一个以勇者的名义大肆杀戮无辜，吸收灵魂为自己所用的怪物而已，这种自我舍弃也罢。",
            "\t[暗妖精,N1584]勇者大人......",
            "\t[勇者,hero]就这样吧，我要继续前进了。",
            "\t[暗妖精,N1584]嗯......",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4, 33,737,1283,1283,  1, 87,  1,1276,  1,1276, 21,  4],
    [  4,  1, 81,  1,  1,  1,  0,  1,1268,  1,1283,  1,  4],
    [  4,1290,  0,861,  0,1141,  0,  1, 21,861,887,  0,  4],
    [  4,  1,861,  1,1276,  1,  1, 33,  1, 82,  1,553,  4],
    [  4,1283,1268,  1,  1,  1, 22,1276,763,1268,228,  0,  4],
    [  4,  1, 81,  1,1268,1276,  1, 34,  1, 81,  1,553,  4],
    [  4,  1,861,  1,  1, 82,  1,  1, 86,  0,  0,  0,  4],
    [  4, 33,  0,888,  0,  0,  0, 81,  0,  1,888,  1,  4],
    [  4,  1, 82,  1,  1,  1,1584,  1,1141,737,  0, 21,  4],
    [  4,1276, 21,1283,  1,  1,  0,  1, 21,  1,1283,  1,  4],
    [  4,1276, 34,1283,  1,  1, 88,  1, 22,  1,1268,  1,  4],
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4]
],
    "bgmap": [

],
    "fgmap": [

]
}