main.floors.MT6=
{
    "floorId": "MT6",
    "title": "主塔 6 层",
    "name": "主塔 6 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "3,1": [
            "\t[小妖精,fairy]......实在是出乎咱的意料，你这家伙居然活着走到这里了。",
            "\t[小妖精,fairy]而且你现在的能力值......已经不是运气好就能达到的程度了，想来是有贵人相助吧。",
            "\t[小妖精,fairy]你这家伙，在开心什么啊！别误会！咱可没有对你刮目相看的意思哦！一丁点都没有！",
            "\t[勇者,hero]......那啥，我可是一句话都没说啊。",
            "\t[小妖精,fairy]啧，不管怎么说，你能够来到这里已经足以说明你的实力......运气不简单了。",
            "\t[小妖精,fairy]事实上你的绝大多数勇者同伴都死在3层那个异常警觉的骷髅士兵手下了。",
            "\t[小妖精,fairy]贪婪果然是你们人类无法根除的本质，就连勇者这样的存在也不可避免。",
            "\t[勇者,hero]不会吧？那些平时牛逼坏了的勇士前辈们......？",
            "\t[小妖精,fairy]剩下几个实力强大的勇者正在进攻第10层，也就是这个区域的最深处。",
            "\t[小妖精,fairy]在魔塔里，通常每10层算一个区域，每个区域都有强力的头目坐镇。",
            "\t[小妖精,fairy]第一区域的头目是骷髅族的骷髅将军，其实在你们之前就有很多人类来挑战过魔塔，但是能攻破骷髅将军防守的人，至今一个都没有。",
            "\t[勇者,hero]谢谢你妖精小姐，为我掉头回老家种田提供了充分的理由。",
            "\t[小妖精,fairy]再怎么说也勉强算个勇者！给咱打起精神来啊！",
            "\t[小妖精,fairy]......呼，算了，如果是你的话，或许真的能有战胜骷髅将军的可能？",
            "\t[小妖精,fairy]不过在跟那家伙交战之前，答应咱，你可千万不要死啊......",
            "\t[勇者,hero]......这种事情不是我自己能够决定的吧？",
            "\t[勇者,hero]哈哈（苦笑）。",
            "\t[勇者,hero]如果我有权力决定自己的生死的话，不管怎样都不会走上勇者这条不归路的啊。",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "1,2": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "9,7": [
            {
                "type": "setValue",
                "name": "flag:door_MT6_10_8",
                "operator": "+=",
                "value": "1"
            }
        ],
        "11,7": [
            {
                "type": "setValue",
                "name": "flag:door_MT6_10_8",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "10,8": {
            "0": {
                "condition": "flag:door_MT6_10_8==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_MT6_10_8",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            }
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  0, 81,124, 32,209,  0,210,210,203,  0, 87,  1],
    [  1, 88,  1, 81,  1,  1,205,  1,  1,  1, 81,  1,  1],
    [  1,  1,  1,203,  1,  1,206,  1,205,202,  0, 22,  1],
    [  1, 22,204,  0, 31,  0,  0, 81,202,  1, 86,  1,  1],
    [  1, 29,  1, 21,  1, 82,  1,  1,  1,  1,206,  1,  1],
    [  1,  1, 32,  1,  1,  0,202,  0,  0, 28, 32, 27,  1],
    [  1, 31,  0,203,  0, 32,  1, 81,  1,210,  0,210,  1],
    [  1,216,  1,  1,206,  1,  1,203,  1,  1, 85,  1,  1],
    [  1, 28, 86,  0,  0,203,  1, 22,  1, 21,  0, 22,  1],
    [  1, 27,  1,203,  1,210, 86, 32,  1,  0, 36,  0,  1],
    [  1, 32,  1, 31, 21,203,  1, 27,  1, 32,  0, 32,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

]
}