main.floors.MT9=
{
    "floorId": "MT9",
    "title": "主塔 9 层",
    "name": "主塔 9 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "2,11": [
            "\t[小妖精,fairy]该说是意料之外，还是预料之中呢？",
            "\t[小妖精,fairy]那几个贸然进攻第10层的勇者，他们的气息咱已经无法感知了，想必那些勇者已经惨遭不测。",
            "\t[小妖精,fairy]相反地，这群人之中最不像勇者的你，只有你一个人坚持到了现在。",
            "\t[小妖精,fairy]你先别得意啊！别误会！咱可没有对你刮目相看的意思哦！别膨胀得太厉害你这混蛋！",
            "\t[勇者,hero]喂喂！我还是一句话都没说啊！",
            "\t[小妖精,fairy]......啧，算了，不管是凭借运气还是实力，你能到达这里就说明你有本事。",
            "\t[小妖精,fairy]即便这样咱也不承认你勇者的名分就是了。",
            "\t[勇者,hero]......其实这种名分连我自己都不想承认。",
            "\t[勇者,hero]要不是那次屠城的幸存者只剩我一个的话，估计我现在还安安分分地在王都的某个角落里乞讨吧。",
            "\t[小妖精,fairy]啧啧......你好像意外地是个有故事的男人啊？不过咱对你的过往连一丁点想要追根问底的想法都没有。",
            "\t[小妖精,fairy]再往上走一层，就是这个区域最后的关卡了，骷髅将军也应该已经感受到你的气息，正在排兵列阵呢。",
            "\t[小妖精,fairy]他跟你之前遇到的所有杂鱼魔物都不同，强大而无情，是个非常难缠的对手。",
            "\t[勇者,hero]我有战胜那家伙的可能性吗？",
            "\t[小妖精,fairy]几乎不可能。",
            "\t[勇者,hero]喂喂不假思索地就说出来了啊！......我现在往回走还来得及吗？",
            "\t[小妖精,fairy]这是你自己的选择，勇者大人。",
            "\t[小妖精,fairy]英雄跟逃兵，往往只隔一念之遥。",
            {
                "type": "sleep",
                "time": 500,
                "noSkip": true
            },
            "\t[勇者,hero]等等，你刚才叫我什么？",
            "\t[小妖精,fairy]....../////",
            "\t[小妖精,fairy]笨......笨蛋！你可别指望咱会说第二次！！！/////",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ],
        "10,11": [
            {
                "type": "if",
                "condition": "(flag:talkedWith9FShop===0)",
                "true": [
                    "\t[盗贼,thief]嘿！哥们儿！我们又见面了！",
                    "\t[盗贼,thief]说起来，我在四层宝库里顺手偷到了一件很不错的装备。",
                    "\t[盗贼,thief]我看与你有缘，就400金币卖给你吧！",
                    "\t[勇者,hero]按理来说不是应该直接送给我的吗？？",
                    "\t[盗贼,thief]我个盗贼也要讨生活的嘛......这样吧，如果你买了这件装备，我再额外赠送你一条有用的信息！",
                    {
                        "type": "setValue",
                        "name": "flag:talkedWith9FShop",
                        "value": "1"
                    }
                ],
                "false": [
                    {
                        "type": "choices",
                        "text": "\t[盗贼,thief]怎样，要买吗？400金币就能入手的绝世神兵！",
                        "choices": [
                            {
                                "text": "是",
                                "action": [
                                    {
                                        "type": "if",
                                        "condition": "(status:money>=400)",
                                        "true": [
                                            {
                                                "type": "setValue",
                                                "name": "status:money",
                                                "operator": "-=",
                                                "value": "400"
                                            },
                                            "\t[盗贼,thief]哈哈！这个月的生活费到手了！......咳咳，多谢了哥们儿。",
                                            "\t[盗贼,thief]出手这么阔绰的白痴......啊不哥们儿，我还是第一次遇见呢！",
                                            "\t[盗贼,thief]看在你这么豪爽的份上，我就告诉你一条其他人绝对不知道的信息吧。",
                                            "\t[盗贼,thief]这座塔其实不止50层，据我所知0层有一条通往地下世界的密道，此外塔内还有着通往各种魔法空间的隐藏通道。",
                                            "\t[勇者,hero]诶？为什么你会知道这些？你不是只在第一区域活动过吗？",
                                            "\t[盗贼,thief]这......嘿嘿嘿。我可是无所不能的杰克大盗啊！弄到这种小情报的手段还不是一抓一大把！",
                                            "\t[盗贼,thief]比起这个，哥们儿！赶紧去击败这个区域的头目为我开路吧！下个区域还有数不尽的珍宝等着我们去入手！",
                                            "\t[盗贼,thief]就这样！后会有期！溜了溜了！",
                                            {
                                                "type": "hide",
                                                "remove": true,
                                                "time": 500
                                            }
                                        ],
                                        "false": [
                                            "\t[盗贼,thief]你的金币不足！",
                                            {
                                                "type": "continue",
                                                "n": 1
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "text": "否",
                                "action": [
                                    {
                                        "type": "exit"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ],
        "6,3": [
            "\t[普通老人,man]务必准备周全再上楼。",
            "\t[普通老人,man]头目战前勤存档，切记切记。",
            "\t[普通老人,man]希望我在下个区域还能遇见活着的你。",
            "\t[勇者,hero]......那还真是借你吉言了啊。",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "0,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": "MT10",
            "loc": [
                6,
                2
            ],
            "direction": "down"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  5,  5,  5,  5,  5,  1,  1,  1,  5,  5,  5,  5,  5],
    [  5,  5,  5,  5,  1,  1, 87,  1,  1,  5,  5,  5,  5],
    [  5,  5,  5,  1,  1, 32,  0, 32,  1,  1,  5,  5,  5],
    [  5,  1,  1,  1,  1,  1,121,  1,  1,  1,  1,  1,  5],
    [  5,  1, 27, 27, 27,  1, 82,  1, 28, 28, 28,  1,  5],
    [  1,  1, 32, 32, 32,  1, 82,  1, 31, 31, 31,  1,  1],
    [  1,  1,  0,  0,  0,  1, 82,  1,  0,  0,  0,  1,  1],
    [  1,  1,  1, 85,  1,  1, 81,  1,  1, 85,  1,  1,  1],
    [  1, 22,  1,  0,  0,  1, 81,  1,  0,  0,  1, 21,  1],
    [  1, 22, 85,  0,  0,  0,  0,  0,  0,  0, 85, 21,  1],
    [  1,  1,  1,  1,  0,  0,  0,  0,  0,  1,  1,  1,  1],
    [ 88,  0,124, 81,  0,  0,  0,  0,  0, 82,123,1340,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "fullmoonplan.mp3"
}