main.floors.MT9=
{
    "floorId": "MT9",
    "title": "主塔 9 层",
    "name": "9",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "2,11": [
            "\t[小妖精,fairy]该说是意料之外，还是预料之中呢？",
            "\t[小妖精,fairy]那几个贸然进攻第10层的勇者，他们的气息咱已经无法感知了，想必那些勇者已经惨遭不测。",
            "\t[小妖精,fairy]相反地，这群人之中最不像勇者的你，只有你一个人坚持到了现在。",
            "\t[小妖精,fairy]你先别得意啊！别误会！咱可没有对你刮目相看的意思哦！别膨胀得太厉害你这混蛋！",
            "\t[勇者,hero]喂喂！我还是一句话都没说啊！",
            "\t[小妖精,fairy]......啧，算了，不管是凭借运气还是实力，你能到达这里就说明你有本事。",
            "\t[小妖精,fairy]即便这样咱也不承认你勇者的名分就是了。",
            "\t[勇者,hero]......其实这种名分连我自己都不想承认。",
            "\t[勇者,hero]要不是那次屠城的幸存者只剩我一个的话，估计我现在还安安分分地在王都的某个角落里乞讨吧。",
            "\t[小妖精,fairy]啧啧......你好像意外地是个有故事的男人啊？不过咱对你的过往连一丁点想要追根问底的想法都没有。",
            "\t[小妖精,fairy]再往上走一层，就是这个区域最后的关卡了，骷髅将军也应该已经感受到你的气息，正在排兵列阵呢。",
            "\t[小妖精,fairy]他跟你之前遇到的所有杂鱼魔物都不同，强大而无情，是个非常难缠的对手。",
            "\t[勇者,hero]我有战胜那家伙的可能性吗？",
            "\t[小妖精,fairy]几乎不可能。",
            "\t[勇者,hero]喂喂不假思索地就说出来了啊！......我现在往回走还来得及吗？",
            "\t[小妖精,fairy]这是你自己的选择，勇者大人。",
            "\t[小妖精,fairy]英雄跟逃兵，往往只隔一念之遥。",
            {
                "type": "sleep",
                "time": 500,
                "noSkip": true
            },
            "\t[勇者,hero]等等，你刚才叫我什么？",
            "\t[小妖精,fairy]....../////",
            "\t[小妖精,fairy]笨......笨蛋！你可别指望咱会说第二次！！！/////",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "0,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  5,  5,  5,  5,  5,  1,  1,  1,  5,  5,  5,  5,  5],
    [  5,  5,  5,  5,  1,  1, 87,  1,  1,  5,  5,  5,  5],
    [  5,  5,  5,  1,  1, 32,  0, 32,  1,  1,  5,  5,  5],
    [  5,  1,  1,  1,  1,  1,121,  1,  1,  1,  1,  1,  5],
    [  5,  1, 27, 27, 27,  1, 82,  1, 28, 28, 28,  1,  5],
    [  1,  1, 32, 32, 32,  1, 82,  1, 31, 31, 31,  1,  1],
    [  1,  1,  0,  0,  0,  1, 82,  1,  0,  0,  0,  1,  1],
    [  1,  1,  1, 85,  1,  1, 81,  1,  1, 85,  1,  1,  1],
    [  1, 22,  1,  0,  0,  1, 81,  1,  0,  0,  1, 21,  1],
    [  1, 22, 85,  0,  0,  0,  0,  0,  0,  0, 85, 21,  1],
    [  1,  1,  1,  1,  0,  0,  0,  0,  0,  1,  1,  1,  1],
    [ 88,  0,124, 81,  0,  0,  0,  0,  0, 82,123, 50,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

]
}