main.floors.MU1=
{
    "floorId": "MU1",
    "title": "地下 1 层",
    "name": "地下 1 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": [
            "\t[暗妖精,N1584]那、那个......你好，我是暗妖精，地下层的引路人。",
            "\t[暗妖精,N1584]那个......对了！欢欢欢欢迎来到地下层！尊贵的勇者大人。",
            "\t[勇者,hero]......尊贵的勇者大人？？",
            "\t[暗妖精,N1584]啊？我说的有哪里不对吗？......对、对不起！",
            "\t[暗妖精,N1584]明明练习了那么多遍却......呜呜呜，说错了话会被勇者大人吃掉的......",
            "\t[勇者,hero]不对，不会吃掉你啊！",
            "\t[勇者,hero]等等，你对我这个人是不是存在一些误解？你把勇者这种存在当成什么了？",
            "\t[暗妖精,N1584]诶？族人都告诉我说勇者大人是一种一不开心就要吃小妖精的食人魔啊。",
            "\t[勇者,hero]那你的族人们的心眼可真是坏到家了啊......",
            "\t[勇者,hero]话说回来，这家伙明明是暗妖精族，却意外地是个弱气软妹的性格......反观某位性格恶劣的妖精小姐......啧啧。",
            "\t[暗妖精,N1584]勇勇勇者大人......您在嘀咕什么啊？果然还是要吃掉我吗......呜呜呜......",
            "\t[勇者,hero]都说了不会吃掉你啊！......喂，别哭了。",
            "\t[暗妖精,N1584]嗯嗯......（抽泣）",
            "\t[勇者,hero]呼，暗妖精小姐，你在我面前不用表现得这么拘谨哦，也不要用您这个让我浑身不自在的称呼。",
            "\t[暗妖精,N1584]......真的吗？",
            "\t[勇者,hero]嗯，毕竟勇者也并不是什么了不起的存在。",
            "\t[暗妖精,N1584]......（悄悄地用上目线看着这边）",
            "\t[勇者,hero]唔......你好像不太擅长跟人类交流的样子，是这样吗？",
            "\t[暗妖精,N1584]......嗯嗯，这......这是我第一次看见活的人类。",
            "\t[勇者,hero]这家伙的成长环境问题很大啊（小声）......暗妖精小姐，第一次看见人类的感想如何？",
            "\t[暗妖精,N1584]有点傻乎乎的感觉，并没有传闻中那样强大，给人的初印象非常无害。",
            "\t[勇者,hero]该说不愧是妖精族吗？只有在挖苦我的时候话不断断续续......",
            "\t[暗妖精,N1584]呀！对对对对不起！不小心把自己的真实想法说漏嘴了真是万分抱歉！请不要吃掉我！",
            "\t[暗妖精,N1584]真的十分对不起......我家就只有我一个独苗......不要吃我！呜呜呜......",
            "\t[勇者,hero]诶！别哭啊，我都说了不会吃你的了。",
            "\t[勇者,hero]她哭着跑开了......",
            "\t[勇者,hero]这股强烈的负罪感是怎么回事......",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "1,12": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,0": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  3,  3,  3,  3,  3,  3, 87,  3,  3,  3,  3,  3,  3],
    [  3, 59, 22,1276,  3,1283,  0,1276,  3, 58,  3, 32,  3],
    [  3,  3,  3, 82,  3, 59,1584, 32,  3,1283,  3,1276,  3],
    [  3, 32,214,  0,  3,  3, 86,  3,  3,1133, 81, 21,  3],
    [  3, 81,  3,1133, 81,277,  0,558,277,  0,  3,250,  3],
    [  3,  0,874,  0,  3,  3,  3,  3,  3,  0,558,  0,  3],
    [  3,277,  3,  3,  3, 22, 21, 81,1276,  3, 81,  3,  3],
    [  3,  0, 34,1283,  3,1276,1283,  3, 33,  3, 58,  3,  3],
    [  3, 81,  3,  3,  3,  3,1078,  3,  3,  3, 81,  3,  3],
    [  3,558,248, 22,  3,  0,558,1276,1283,  3,248, 59,  3],
    [  3, 33,  3,  3,  3, 81,  3,874,  3, 58,  3, 86,  3],
    [  3,  0, 82, 21,1276, 22,256,  0,1078, 21,1276, 34,  3],
    [  3, 88,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3]
],
    "underGround": true,
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "dixia.mp3"
}