main.floors.MU9=
{
    "floorId": "MU9",
    "title": "地下 9 层",
    "name": "地下 9 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,9": [
            "\t[暗妖精,N1584]那、那个......你好！勇者大人！！",
            "\t[勇者,hero]说话的声音变得很大声了，看来你的确有在好好努力哦。",
            "\t[暗妖精,N1584]是......是吗？诶嘿嘿......",
            "\t[暗妖精,N1584]不对！比起这个我有更重要的事情要告诉勇者大人！",
            "\t[勇者,hero]嗯，怎么了？",
            "\t[暗妖精,N1584]勇者大人应该知道血影的存在吧？",
            "\t[勇者,hero]当然知道啊，这一路上到处都是这种恶心的章鱼幼崽，我的剑上现在还残留着它们的体液。",
            "\t[暗妖精,N1584]你说的那些都是血影的幼体......真正的血影是不容小觑的存在。",
            "\t[暗妖精,N1584]血影是以高纯度的熔岩为媒介，以各种生物的血肉与怨念为饲料喂养出来的强大魔物。",
            "\t[暗妖精,N1584]一座魔塔里一般只有一只，是极少数实力仅次于魔王的存在。",
            "\t[勇者,hero]这么恐怖的吗？我竟然杀了那么多幼崽！现在回去跟母体道歉还来得及吗？",
            "\t[暗妖精,N1584]别激动勇者大人......血影是你迟早要正面对抗的东西，只是时机未到而已。",
            "\t[勇者,hero]听你这么一说我反而更慌了。",
            "\t[暗妖精,N1584]勇者大人听我说......血影是人为饲养的生物，这个区域饲养血影的人名叫追魂，也就是地下一区域的头目。",
            "\t[勇者,hero]追魂吗......我对这个始作俑者的名字并不意外呢。",
            "\t[暗妖精,N1584]这么一说，勇者大人你是知道追魂的咯？",
            "\t[勇者,hero]那是当然，不如说我来地下层的目的就是讨伐那家伙吧。",
            "\t[暗妖精,N1584]真的吗？这样一来就再好不过了！耶————————！！",
            "\t[勇者,hero]暗、暗妖精小姐，不要突然抱住我啊！",
            "\t[暗妖精,N1584]啊！......抱抱抱抱歉！我不小心失态了......对不起勇者大人！",
            "\t[暗妖精,N1584]我只是太开心了......我来这里就是想拜托勇者大人打败追魂的，没想到居然会有这么巧合的事情。",
            "\t[勇者,hero]那个追魂跟你有什么渊源吗？",
            "\t[暗妖精,N1584]不是跟我......我刚才应该跟勇者大人说过，血影的饲料是一切生物的怨念与血肉吧？",
            "\t[暗妖精,N1584]追魂是魔王钦点的血影饲养者，所以他平时大部分时间都在魔塔外捕杀生命，很少打理这个区域。",
            "\t[暗妖精,N1584]可是......最近不知道是怎么回事，他以血影的食量越来越大为理由，杀害了许多无辜的地下层魔物，作为血影的饵食。",
            "\t[勇者,hero]这也太过分了吧？生命在他眼里就廉价到这种地步吗？",
            "\t[暗妖精,N1584]所以，拜托了勇者大人......为了地下层不毁在他手上，请您一定要战胜追魂啊。",
            "\t[勇者,hero]嗯，我会全力以赴的。还有，不是说了不要用您来称呼我么......",
            "\t[暗妖精,N1584]啊！勇者大人对不起！......我、我忘记了！......呜呜呜......",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            },
            "\t[暗妖精,N1584]果然，她又哭着跑开了......"
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "11,8": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  3,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  3],
    [  3,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  3],
    [  3,  5,  5,  5,  5,  5,467,  5,  5,  5,  5,  5,  3],
    [  3,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  3],
    [  3,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  3],
    [  3,  5,  5,  5,  5,  3,  5,  3,  5,  5,  5,  5,  3],
    [  3,  5,  5,  5,  5,  3,  5,  3,  5,  5,  5,  5,  3],
    [  3,  3,  3,  3,  3,  3, 84,  3,  3,  3,  3,  3,  3],
    [  3, 33, 33, 34, 34,248,  0,  0,  0,  0,  0, 88,  3],
    [  3,  3,  3, 85,  3,  3,1584,  3,  3, 85,  3,  3,  3],
    [  3, 21, 22, 34, 34,  3,  0,  3,1276,1276,1276,1290,  3],
    [  3, 21, 24, 33, 33,  3,  0,  3,1283,1283,1283,1290,  3],
    [  3,  3,  3,  3,  3,  3, 87,  3,  3,  3,  3,  3,  3]
],
    "underGround": true,
    "bgmap": [

],
    "fgmap": [

]
}